experiments/results/logs/periodic-hybrid-005/wrk2.txt
Running 10m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 6332.864ms, rate sampling interval: 17514ms
  Thread calibration: mean lat.: 6261.870ms, rate sampling interval: 17383ms
  Thread calibration: mean lat.: 6227.934ms, rate sampling interval: 16097ms
  Thread calibration: mean lat.: 6227.265ms, rate sampling interval: 17530ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.53m     1.79m    7.16m    69.83%
    Req/Sec     6.90      3.18    13.00     88.15%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.10m 
 75.000%    5.82m 
 90.000%    6.43m 
 99.000%    7.01m 
 99.900%    7.10m 
 99.990%    7.13m 
 99.999%    7.16m 
100.000%    7.16m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8896.511     0.000000            1         1.00
   85786.623     0.100000         1733         1.11
  178913.279     0.200000         3467         1.25
  241958.911     0.300000         5199         1.43
  281804.799     0.400000         6943         1.67
  305922.047     0.500000         8673         2.00
  315621.375     0.550000         9534         2.22
  324009.983     0.600000        10397         2.50
  332398.591     0.650000        11292         2.86
  340525.055     0.700000        12154         3.33
  348913.663     0.750000        13018         4.00
  353894.399     0.775000        13442         4.44
  358612.991     0.800000        13866         5.00
  364118.015     0.825000        14307         5.71
  370147.327     0.850000        14738         6.67
  377749.503     0.875000        15172         8.00
  381419.519     0.887500        15386         8.89
  385613.823     0.900000        15598        10.00
  389283.839     0.912500        15814        11.43
  392953.855     0.925000        16036        13.33
  397672.447     0.937500        16247        16.00
  400556.031     0.943750        16360        17.78
  402915.327     0.950000        16477        20.00
  405012.479     0.956250        16578        22.86
  407633.919     0.962500        16691        26.67
  409993.215     0.968750        16789        32.00
  411828.223     0.971875        16850        35.56
  413138.943     0.975000        16901        40.00
  414711.807     0.978125        16962        45.71
  415760.383     0.981250        17010        53.33
  417333.247     0.984375        17064        64.00
  418119.679     0.985938        17086        71.11
  419168.255     0.987500        17115        80.00
  420216.831     0.989062        17144        91.43
  421003.263     0.990625        17167       106.67
  421789.695     0.992188        17199       128.00
  422313.983     0.992969        17208       142.22
  422838.271     0.993750        17228       160.00
  423100.415     0.994531        17236       182.86
  423624.703     0.995313        17252       213.33
  424148.991     0.996094        17264       256.00
  424411.135     0.996484        17272       284.44
  424673.279     0.996875        17280       320.00
  424935.423     0.997266        17292       365.71
  424935.423     0.997656        17292       426.67
  425459.711     0.998047        17299       512.00
  425459.711     0.998242        17299       568.89
  425721.855     0.998437        17303       640.00
  425983.999     0.998633        17310       731.43
  425983.999     0.998828        17310       853.33
  426508.287     0.999023        17316      1024.00
  426508.287     0.999121        17316      1137.78
  426508.287     0.999219        17316      1280.00
  426770.431     0.999316        17325      1462.86
  426770.431     0.999414        17325      1706.67
  426770.431     0.999512        17325      2048.00
  426770.431     0.999561        17325      2275.56
  426770.431     0.999609        17325      2560.00
  426770.431     0.999658        17325      2925.71
  426770.431     0.999707        17325      3413.33
  426770.431     0.999756        17325      4096.00
  426770.431     0.999780        17325      4551.11
  426770.431     0.999805        17325      5120.00
  427819.007     0.999829        17326      5851.43
  427819.007     0.999854        17326      6826.67
  427819.007     0.999878        17326      8192.00
  428343.295     0.999890        17327      9102.22
  428343.295     0.999902        17327     10240.00
  428343.295     0.999915        17327     11702.86
  428343.295     0.999927        17327     13653.33
  428343.295     0.999939        17327     16384.00
  429654.015     0.999945        17328     18204.44
  429654.015     1.000000        17328          inf
#[Mean    =   272021.658, StdDeviation   =   107281.944]
#[Max     =   429391.872, Total count    =        17328]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  17463 requests in 10.00m, 179.06MB read
  Socket errors: connect 0, read 0, write 0, timeout 12761
Requests/sec:     29.09
Transfer/sec:    305.49KB